# ViewDisplaySketchyLines Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewDisplaySketchyLines Members
ViewDisplaySketchyLines Class Methods Properties See Also
---
The ViewDisplaySketchyLines type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ViewDisplaySketchyLines |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EnableSketchyLines | True to enable sketchy lines visibility. False to disable it. |
| Extension | The extension scale value. Controls the magnitude of line's extension. Values between 0 and 10. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Jitter | The jitter defines jitteriness of the line. Values between 0 and 10. |

# See Also
ViewDisplaySketchyLines Class
Autodesk.Revit.DB Namespace